In [1]:
import pandas as pd

In [5]:
df = pd.read_excel("stock_data.xlsx","Sheet1")

In [6]:
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [26]:
def convertpeople(cell):
    if cell=="n.a.":
        return "sam walton"
    return cell
def converteps(cell):
    return cell == "not available" and "NaN" or cell

In [27]:
df = pd.read_excel("stock_data.xlsx","Sheet1", converters = {
    'people':convertpeople,
    "eps":converteps
})

In [28]:
df

  tickers    eps  revenue price         people
0   GOOGL  27.82       87   845     larry page
1     WMT   4.61      484    65     sam walton
2    MSFT     -1       85    64     bill gates
3    RIL     NaN       50  1023  mukesh ambani
4    TATA    5.6       -1  n.a.     ratan tata

In [33]:
df.to_excel("new.xlsx",sheet_name="stocks",startrow=1,startcol=2,index=False)

In [34]:
  
df_stocks = pd.DataFrame({
    'tickers': ['GOOGL', 'WMT', 'MSFT'],
    'price': [845, 65, 64 ],
    'pe': [30.37, 14.26, 30.97],
    'eps': [27.82, 4.61, 2.12]
})

df_weather =  pd.DataFrame({
    'day': ['1/1/2017','1/2/2017','1/3/2017'],
    'temperature': [32,35,28],
    'event': ['Rain', 'Sunny', 'Snow']
})

In [35]:
with pd.ExcelWriter("Dataframe.xlsx") as dataframe:
    df_stocks.to_excel(dataframe, sheet_name="stocks")
    df_weather.to_excel(dataframe, sheet_name="weather")